podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/CAN0_FLEX_MKE16F16.svd.xml
            <cluster>
               <dim>$(WAKEUP_BUFFER_COUNT)</dim>
               <dimIncrement>16</dimIncrement>
               <name>WMB,@p@f@i</name>
               <addressOffset>0xB40</addressOffset>
               <register>
                  <name>WMBn_CS</name>
                  <description>Wake Up Message Buffer Register for C/S</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>DLC</name>
                        <description>Length of Data in Bytes</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RTR</name>
                        <description>Remote Transmission Request</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Data frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Remote Request frame</description>
                              <value>0b0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IDE</name>
                        <description>ID Extended Bit</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Frame format is standard</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Frame format is extended</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SRR</name>
                        <description>Substitute Remote Request</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WMBn_ID</name>
                  <description>Wake Up Message Buffer Register for ID</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>ID</name>
                        <description>Received ID under Pretended Networking mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>29</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WMBn_D03</name>
                  <description>Wake Up Message Buffer Register for Data 0-3</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>Data_byte_3</name>
                        <description>Received payload corresponding to the data byte 3 under Pretended Networking mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_2</name>
                        <description>Received payload corresponding to the data byte 2 under Pretended Networking mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_1</name>
                        <description>Received payload corresponding to the data byte 1 under Pretended Networking mode</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_0</name>
                        <description>Received payload corresponding to the data byte 0 under Pretended Networking mode</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WMBn_D47</name>
                  <description>Wake Up Message Buffer Register Data 4-7</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>Data_byte_7</name>
                        <description>Received payload corresponding to the data byte 7 under Pretended Networking mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_6</name>
                        <description>Received payload corresponding to the data byte 6 under Pretended Networking mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_5</name>
                        <description>Received payload corresponding to the data byte 5 under Pretended Networking mode</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>Data_byte_4</name>
                        <description>Received payload corresponding to the data byte 4 under Pretended Networking mode</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
